zhao34yan2/jr-ESP32-S3-RLCD-4.2/firmware/sdkconfig.defaults
# HTTPS 证书验证
CONFIG_ESP_TLS=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# ESP32-S3-RLCD-4.2 默认配置

# 芯片
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_CHIP_ERASE=y

# PSRAM — ESP32-S3-WROOM-1-N16R8 (Octal OPI 8MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_TLS_ENABLED=y

# WiFi (configured in secrets.h)
# CONFIG_ESP_WIFI_* not set here

# LVGL
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_FONT_MONTSERRAT_8=n
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=n
# Source Han CJK 全量字库已停用: 三屏 UI 全部显式使用自绘全量 GB2312 字体
# (custom_font_14_big / _16_big, 覆盖 6763 汉字+ASCII+度符号), Source Han 仅作 LVGL
# 默认字体存在, 白占约 2MB 源码对应的 flash. 关掉并把默认字体切回 montserrat_14.
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_14_CJK=n
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=n
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# 编译器优化
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# 日志
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# 串口
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# TLS/HTTPS
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCP_SND_BUF=8192
CONFIG_LWIP_TCP_WND=8192
# Watchdog (关闭, 避免 AP 配网时重启)
CONFIG_ESP_TASK_WDT_EN=n

# 电源管理 — 档位一: 只夜间 light-sleep (白天由代码 light_sleep_enable=false 保持不变)
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# 保守: 睡眠时 CPU 不断电, 避开八线 PSRAM 缓存恢复的不稳点 (底噪略高换稳定)
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=n
